12/data/attachments/e47b69f776a1ad89.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_67b0f2e2-c6c3-4055-a03d-39e9a1ce6a9f</nif:username>
            <nif:friendToBeAdded>Kenneth_off_Friend_79139_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>